bung87.rails
bung87.vscode-gemfile
castwide.solargraph
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
chrmarti.regex
cpmcgrath.codealignment-vscode
dbaeumer.vscode-eslint
denoland.vscode-deno
donjayamanne.githistory
dzhavat.css-flexbox-cheatsheet
eamodio.gitlens
esbenp.prettier-vscode
ezforo.copy-relative-path-and-line-numbers
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
gimenete.github-linker
GitHub.copilot
GitHub.copilot-chat
GitHub.github-vscode-theme
GitHub.vscode-pull-request-github
golang.go
Grafana.vscode-jsonnet
harg.iceberg
hashicorp.terraform
hediet.vscode-drawio
hikionori.kanagawa-vscode-theme
Hridoy.rails-snippets
johnpapa.vscode-peacock
karunamurti.haml
mechatroner.rainbow-csv
mikestead.dotenv
misogi.ruby-rubocop
ms-azuretools.vscode-docker
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
Prisma.prisma
rebornix.ruby
redhat.vscode-yaml
ryu1kn.partial-diff
ryu1kn.text-marker
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
sianglim.slim
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
wayou.vscode-todo-highlight
wingrunr21.vscode-ruby
withfig.fig
wmaurer.change-case
wyze.theme-hybrid-next
zhuangtongfa.material-theme
