amazonwebservices.codewhisperer-for-command-line-companion
biomejs.biome
bradlc.vscode-tailwindcss
bung87.vscode-gemfile
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
chrmarti.regex
cpmcgrath.codealignment-vscode
dbaeumer.vscode-eslint
donjayamanne.githistory
dzhavat.css-flexbox-cheatsheet
eamodio.gitlens
esbenp.prettier-vscode
expo.vscode-expo-tools
ezforo.copy-relative-path-and-line-numbers
figma.figma-vscode-extension
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
gimenete.github-linker
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
grafana.vscode-jsonnet
harg.iceberg
hashicorp.terraform
hediet.vscode-drawio
hikionori.kanagawa-vscode-theme
jock.svg
johnpapa.vscode-peacock
karunamurti.haml
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
naumovs.color-highlight
prisma.prisma
redhat.vscode-yaml
ryu1kn.partial-diff
ryu1kn.text-marker
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
shopify.ruby-lsp
unifiedjs.vscode-mdx
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscodevim.vim
wayou.vscode-todo-highlight
wmaurer.change-case
wyze.theme-hybrid-next
xrc-inc.jsonnet-formatter
yoavbls.pretty-ts-errors
zhuangtongfa.material-theme
