altimateai.vscode-altimate-mcp-server
amazonwebservices.codewhisperer-for-command-line-companion
anthropic.claude-code
ashishalex.dataform-lsp-vscode
biomejs.biome
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
chrmarti.regex
cpmcgrath.codealignment-vscode
dbaeumer.vscode-eslint
donjayamanne.githistory
dorzey.vscode-sqlfluff
eamodio.gitlens
esbenp.prettier-vscode
ezforo.copy-relative-path-and-line-numbers
figma.figma-vscode-extension
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
gimenete.github-linker
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
grafana.vscode-jsonnet
hashicorp.terraform
hediet.vscode-drawio
innoverio.vscode-dbt-power-user
jock.svg
johnpapa.vscode-peacock
karunamurti.haml
mechatroner.rainbow-csv
mikestead.dotenv
minodisk.bigquery-runner
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.makefile-tools
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
mylesmurphy.prettify-ts
naumovs.color-highlight
prisma.prisma
redhat.vscode-yaml
rooveterinaryinc.roo-cline
ryu1kn.partial-diff
ryu1kn.text-marker
samuelcolvin.jinjahtml
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
shinichi-takii.sql-bigquery
shopify.ruby-extensions-pack
shopify.ruby-lsp
sorbet.sorbet-vscode-extension
unifiedjs.vscode-mdx
usernamehw.errorlens
vscodevim.vim
wayou.vscode-todo-highlight
wmaurer.change-case
xrc-inc.jsonnet-formatter
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
