{
  "colorizer": { "branch": "master" },
  "indent-blankline.nvim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lightline.vim": { "branch": "master" },
  "nvim-treesitter": { "branch": "main" },
  "tcomment_vim": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-hybrid": { "branch": "master" },
  "vim-matchup": { "branch": "master" },
  "vim-multiple-cursors": { "branch": "master" },
  "vim-smartinput": { "branch": "master" },
  "vim-surround": { "branch": "master" }
}
