{
  "CamelCaseMotion": { "branch": "master" },
  "accelerated-jk": { "branch": "master" },
  "ale": { "branch": "master" },
  "coc.nvim": { "branch": "release" },
  "colorizer": { "branch": "master" },
  "editorconfig-vim": { "branch": "master" },
  "fzf": { "branch": "master" },
  "fzf.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lightline.vim": { "branch": "master" },
  "open-browser.vim": { "branch": "master" },
  "previm": { "branch": "master" },
  "tcomment_vim": { "branch": "master" },
  "vim-abolish": { "branch": "master" },
  "vim-alignta": { "branch": "master" },
  "vim-endwise": { "branch": "master" },
  "vim-fugitive": { "branch": "master" },
  "vim-hybrid": { "branch": "master" },
  "vim-indent-guides": { "branch": "master" },
  "vim-multiple-cursors": { "branch": "master" },
  "vim-quickrun": { "branch": "master" },
  "vim-rails": { "branch": "master" },
  "vim-smartinput": { "branch": "master" },
  "vim-surround": { "branch": "master" },
  "vim-terraform": { "branch": "master" },
  "vim-toml": { "branch": "main" }
}
