# ref
# https://kakakakakku.hatenablog.com/entry/2020/09/17/124653

tap "argon/mas"
tap "homebrew/bundle"
# tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
# tap "homebrew/core" # いらない？？
tap "lucagrulla/cw"
tap "knqyf263/pet"
tap "kyoshidajp/tosa"

brew "asciinema"
# awscli ver2になっているので一旦除外
# brew "awscli"        # http://docs.aws.amazon.com/cli/latest/userguide/cli-chap-getting-started.html
brew "aicommits"
brew "automake"
brew "ccat"
brew "certbot"
brew "circleci"
brew "cmake"
brew "csshx"
brew "colordiff"
brew "ctags"
brew "deno"
brew "direnv"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "gitleaks"
brew "gnuplot" # gnuplot コマンドで特定のデータからコマンドで簡単にグラフ化するツール
brew "highlight"
brew "hub"
brew "imagemagick"   # imagemagickはrmagickの関係でver6系を入れる。後に対応されたらver7以上とする
brew "itchyny/tap/mmv"
brew "jq"
# brew "jmeter"
brew "jsonnet"
brew "jump"
brew "lesspipe"
brew "lucagrulla/cw/cw" # Cloudwatch logs関連
brew "lha"
brew "lua"
brew "mactop"
brew "mas"
# brew "mecab"
# brew "mecab-ipadic"
# brew "mosquitto"
brew "mpg123"
brew "mkcert"  # localでsslのCA作るやつ
brew "mycli"
brew "mysql-client"
# brew "neovim"
brew "nginx"
brew "ngrep"
brew "nkf"
brew "smudge/smudge/nightlight"
brew "nss" # mkcertで使う
brew "openssl"
# brew "pandoc"  # http://sky-y.github.io/site-pandoc-jp/users-guide/
# brew "packer"
brew "knqyf263/pet/pet"
brew "kyoshidajp/tosa/tosa" # githubのPRを検出する https://qiita.com/kyoshidajp/items/18d5385ef8375c7bcd14
brew "plantuml"
brew "pgcli"
brew "pstree"
brew "pkg-config"
brew "reattach-to-user-namespace"  # 自分でビルドする方法もあり .tmux.conf参照
brew "readline"
brew "redis"
brew "ripgrep"
brew "tfenv"
brew "tflint"
brew "the_platinum_searcher"
brew "the_silver_searcher"
brew "tidy-html5" # tidyのlintでhtml5として有効となるように
brew "tig"
brew "tmux"
brew "tnftp"
brew "tree"
brew "unar"   # zipなどの解凍ツール(winのcp932などでも文字化けしないように)
brew "vim"
brew "watch"
brew "wget"
brew "whois"
brew "yarn"
brew "yt-dlp"
# brew "zsh"

cask "appcleaner"
cask "arc" # ブラウザ
cask "aws-vault"
cask "docker", args: { appdir: "/Applications" }
cask "font-ricty-diminished"
cask "font-jetbrains-mono"
cask "font-noto-sans-cjk-jp"
cask "font-migu-1p"
cask "ghostty"
cask "iterm2"
cask "temurin8"
# virtualbox M1に対応していないみたい...
# cask "virtualbox"  # インストール前に security の設定で Oracle を allowする必要がある
# cask "authy"
cask "android-studio"
# cask "android-platform-tools"
cask "bartender"
# cask "bdash"
# cask "blisk" # 開発用ブラウザ(モバイル等も)
cask "cocoapods"
# cask "charles"
# cask "calibre"
cask "contexts"
cask "craft"
# cask "cyberduck"
cask "cursor"
cask "datagrip"
# cask "deepl"
cask "discord"
cask "drawio"
cask "dropbox"
cask "dynalist"
cask "fig"
cask "figma"
cask "firefox"
cask "flipper"
cask "google-japanese-ime"
cask "google-chrome"
cask "google-drive"
cask "goland"
cask "iterm2"
cask "intellij-idea"
# cask "java"
cask "karabiner-elements"
cask "kindle"
# cask "krisp"
# cask "licecap" # 使えなくなっている...
cask "ngrok"           # [ngrokを使用してローカル環境を外部に公開する - Qiita](https://qiita.com/kitaro729/items/44214f9f81d3ebda58bd)
cask "notion"
cask "obsidian"
cask "onedrive"
cask "orbstack"
cask "pika"
cask "postman"
cask "raycast"
cask "rubymine"
# cask "skitch"
# cask "skype"
cask "slack"
# cask "sizzy" # モバイル等のマルチデバイスアプリ
# cask "vagrant"
cask "visual-studio-code"
# cask "vivaldi"
cask "vysor" # スマホミラーリングアプリ
cask "webstorm"
# cask "xmind"
# cask "xquartz"
cask "zed"
cask "zoom"
