# 既存環境からBrewfile作成：brew bundle dump --describe --force
# 事前チェック：brew bundle check
# 実行（不足分だけ入れる）：brew bundle --no-upgrade


brew 'git'
brew 'envchain'
brew 'mise'
brew 'tig'
brew 'openssl@3'
brew 'tmux'
brew 'mysql-client' # Execute => brew link --force mysql-client
brew 'libpq'  # (psql client) Execute => brew link --force libpq

# brew 'asciinema'
# brew "aicommits"
# brew "automake"
# brew "ccat"
# brew "certbot"
# brew "cmake"
# brew "csshx"
# brew "colordiff"
# brew "ctags"
# brew "deno"
# brew "direnv"
# brew "ffmpeg"
# brew "gh"
# brew "gitleaks"
# brew "gnuplot" # gnuplot コマンドで特定のデータからコマンドで簡単にグラフ化するツール
# brew "highlight"
# brew "imagemagick"   # imagemagickはrmagickの関係でver6系を入れる。後に対応されたらver7以上とする
# brew "itchyny/tap/mmv"
# brew "jsonnet"
# brew "jump"
# brew "lesspipe"
# brew "lucagrulla/cw/cw" # Cloudwatch logs関連
# brew "lha"
# brew "lua"
# brew "mactop"
# brew "mas"
# # brew "mecab"
# # brew "mecab-ipadic"
# # brew "mosquitto"
# brew "mpg123"
# brew "mkcert"  # localでsslのCA作るやつ
# brew "mycli"
# brew "nginx"
# brew "ngrep"
# brew "nkf"
# brew "smudge/smudge/nightlight"
# brew "nss" # mkcertで使う
# # brew "pandoc"  # http://sky-y.github.io/site-pandoc-jp/users-guide/
# # brew "packer"
# brew "knqyf263/pet/pet"
# brew "kyoshidajp/tosa/tosa" # githubのPRを検出する https://qiita.com/kyoshidajp/items/18d5385ef8375c7bcd14
# brew "go-parquet-tools"
# brew "plantuml"
# brew "pgcli"
# brew "pstree"
# brew "pkg-config"
# brew "reattach-to-user-namespace"  # 自分でビルドする方法もあり .tmux.conf参照
# brew "readline"
# brew "redis"
# brew "tfenv"
# brew "tflint"
# brew "the_platinum_searcher"
# brew "the_silver_searcher"
# brew "tidy-html5" # tidyのlintでhtml5として有効となるように
# brew "tnftp"
# brew "tree"
# brew "unar"   # zipなどの解凍ツール(winのcp932などでも文字化けしないように)
# brew "watch"
# brew "wget"
# brew "whois"
# brew "yt-dlp"

cask '1password-cli'
cask 'chatgpt'
cask 'appcleaner'
cask 'arc' # ブラウザ
cask 'aws-vault-binary'
cask 'claude'
cask 'font-ricty-diminished'
cask 'font-jetbrains-mono'
cask 'font-noto-sans-cjk-jp'
cask 'font-migu-1p'
cask 'bartender'
cask 'contexts'
cask 'cursor'
cask 'deepl'
cask 'discord'
cask 'dropbox'
cask 'figma'
cask 'gcloud-cli'
cask 'google-japanese-ime'
cask 'karabiner-elements'
cask 'obsidian'
# cask 'onedrive'
cask 'orbstack'
cask 'raycast'
cask 'visual-studio-code'
cask 'notion'
cask 'zoom'
cask 'slack'
cask 'iterm2'
cask 'session-manager-plugin'

# cask "temurin8"
# # cask "android-platform-tools"
# # cask "blisk" # 開発用ブラウザ(モバイル等も)
# # cask "cocoapods"
# # cask "charles"
# # cask "calibre"
# # cask "craft"
# # cask "cyberduck"
# cask "datagrip"
# cask "drawio"
# cask "fig"
# cask "firefox"
# cask "flipper"
# cask "google-chrome"
# cask "google-drive"
# cask "goland"
# cask "intellij-idea"
# # cask "java"
# cask "ngrok"
# cask "pika"
# cask "postman"
# cask "rubymine"
# # cask "skitch"
# # cask "skype"
# # cask "sizzy" # モバイル等のマルチデバイスアプリ
# # cask "vagrant"
# # cask "vivaldi"
# cask "vysor" # スマホミラーリングアプリ
# # cask "webstorm"
# # cask "xmind"
# # cask "xquartz"
# cask "zed" # editor
